posts/notes/java-troubleshooting/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Java Troubleshotting Note | Warren Liu</title>
<link href="../../../assets/css/rst.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/poole.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/lanyon.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/custom.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="//fonts.googleapis.com/css?family=PT+Serif:400,400italic,700%7CPT+Sans:400">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../rss.xml">
<link rel="canonical" href="https://wudong.graceliu.uk/posts/notes/java-troubleshooting/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../javascript-note/" title="Javascript Note" type="text/html">
<link rel="next" href="../java-problems/" title="Java Problems" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="Java Troubleshotting Note">
<meta property="og:url" content="https://wudong.graceliu.uk/posts/notes/java-troubleshooting/">
<meta property="og:description" content="Table of Contents


Options/Flags for JVM trobuleshotting
Java Mission Control
Java Flight Recordings





Options/Flags for JVM trobuleshotting


Core files: If java crashes, for example due to a seg">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-14T00:00:00+01:00">
<meta property="article:tag" content="java">
</head>
<body>
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>
    <!-- Target for toggling the sidebar `.sidebar-checkbox` is for regular
            styles, `#sidebar-checkbox` for behavior. -->
    <input type="checkbox" class="sidebar-checkbox" id="sidebar-checkbox"><!-- Toggleable sidebar --><div class="sidebar" id="sidebar">
        <div class="sidebar-item">
            <p>A reserved <a href="https://getnikola.com" target="_blank">Nikola</a> theme that places the utmost gravity on content with a hidden drawer. Made by <a href="https://twitter.com/mdo" target="_blank">@mdo</a> for Jekyll,
            ported to Nikola by <a href="https://twitter.com/ralsina" target="_blank">@ralsina</a>.</p>
        </div>
        
    <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../../archive.html">Archive</a>
        <a class="sidebar-nav-item" href="../../../categories/">Tags</a>
        <a class="sidebar-nav-item" href="../../../rss.xml">RSS feed</a>
    
    
    </nav>
</div>

    <!-- Wrap is the content to shift when toggling the sidebar. We wrap the
         content to avoid any CSS collisions with our real content. -->
    <div class="wrap">
      <div class="masthead">
        <div class="container">
          
    <h3 id="brand" class="masthead-title">
      <a href="https://wudong.graceliu.uk/" title="Warren Liu" rel="home">Warren Liu</a>
    </h3>

        </div>
      </div>

      <div class="container content" id="content">
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="post-title p-name entry-title" itemprop="headline name"><a href="." class="u-url">Java Troubleshotting Note</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn">Warren Liu</span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="post-date published dt-published" datetime="2017-07-14T00:00:00+01:00" itemprop="datePublished" title="2017-07-14 00:00">2017-07-14 00:00</time></a></p>
        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Options/Flags for JVM trobuleshotting</a></li>
<li><a href="#sec-2">Java Mission Control</a></li>
<li><a href="#sec-3">Java Flight Recordings</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Options/Flags for JVM trobuleshotting</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Core files: If java crashes, for example due to a segmentation
fault, the OS saves to disk a core file (complete dump of the
memory).
<ul class="org-ul">
<li>On linux, using <code>ulimit -c unlimited</code> before starting the
application will usually enable core file dump.
</li>
<li>to force on core file when the application cannot be closed
properly, using <br><code>kill -6 &lt;pid&gt;</code>
</li>
</ul>
</li>
<li>Heap dump: add <code>-XX:+HeapDUmpOnOutOfMemoryError</code> flags save java
heap dump to disk if the application runs into an
<b>OutOfMemoryError</b>. <code>jhat</code> can be used to inspect the Java heap.
</li>
<li>Using a continious Java flight recording (JFR).
<ul class="org-ul">
<li>The JFR events can be extremely helpful to debug a wide range of
issues from <i>memory leaks</i> to <i>network errors</i>, high CPU usage/, <i>thread
blocks</i>, etc.
</li>
<li>The overhead of running with a continious flight recording is <b>very low</b>.
</li>
</ul>
</li>
<li>Verbose GC with <code>-verbosegc</code>:
<ul class="org-ul">
<li>Does GC run for a long time?
</li>
<li>Does the free memory decrease over time?
</li>
<li>Use flags <code>UseGClogFileRotation</code> and <code>NumberOfGCLogFiles</code> to set
up log rotation.
</li>
</ul>
</li>
<li>Print Java version and JVM flags:
<ul class="org-ul">
<li>Using <code>-XX:+PrintCommandLineFlags</code>
</li>
<li>and <code>-showversion</code>
</li>
</ul>
</li>
<li>Set up JMC JMX for remote monitoring:
<ul class="org-ul">
<li>There is no performance overhead in enabling JMX
</li>
<li>To enable JMX after java application has started using the
diagnostic command <b>ManageAgent.start</b>, run <br><code>jcmd &lt;pid&gt; help ManagementAgent.start</code> <br>
    for a list of flags that can be send with the command
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Java Mission Control</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Java Management console (JMX) connects to a running JVM, collects
and displays key characterstics in real time.
</li>
<li>Java Flight Recordings (JFR) is available to analyze events.
</li>
<li>JMC can <i>trigger</i> user <span class="underline">provided custom actions and rules</span> for JVM.
</li>
<li>
<b>DTrace</b> plugin is an extended <b>DScript</b> language to produce self
describing events.
</li>
<li>
<b>JOverview</b> plugin is a tool for analyzing heap waste (emtpy/sparse
collections), which use hprof dumps.
</li>
<li>The JMC plugins connect to JVM using JMX agents.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Java Flight Recordings</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>The JFR records detailed information about the java runtime and the
java application running in the java runtime with little overhead.
</li>
<li>Typical events can be threads waiting for locks, GC, periodic CPU
usage data, etc.
</li>
<li>When creating a flight recording, you select which events should be
saved, which is called a <b>recording template</b>.
</li>
<li>A <b>Continuous Recording</b> is a recording that is always on and
saves, for example, the last six hours of data.
<ul class="org-ul">
<li>The default setting for it is to use a recording profile with
extremely low overhead.
</li>
<li>It is great to always have running. The recoding can be dumped
manually using either <b>JCMD</b> or <b>JMC</b>, or set a trigger in JMC to
dump when some criteria is fulfilled.
</li>
<li>It can be started from the command line using <code>-XX:FlightRecorderOptions</code>.
</li>
</ul>
</li>
<li>A <b>Profiling Recordings</b> is a recording that is turned on, runs for
a set amount of time, and then stops. It might have slightly bigger
performance impact. It typical usage includes:
<ul class="org-ul">
<li>Profile what methods are run the most and where most objects are created.
</li>
<li>Look for classes that use more and more heap indicating a memory leak.
</li>
<li>Look for bottle necks due to synchronization.
</li>
<li>The typical overhead for a profiling recording is about <b>2 precent</b>.
</li>
<li>It can be started at the start of the application using
<code>-XX:StartFlightRecording</code> option. For example:<br><div class="highlight"><pre><span></span>java -XX:+UnlockCommercialFeatures -XX:+FlightRecorder <span class="se">\</span>
     -XX:StartFlightRecording<span class="o">=</span><span class="nv">delay</span><span class="o">=</span>20s,duration<span class="o">=</span>60s,name<span class="o">=</span>myrecording,<span class="se">\</span>
     <span class="nv">filename</span><span class="o">=</span>C:<span class="se">\T</span>EMP<span class="se">\m</span>yrecording.jfr,settings<span class="o">=</span>profile MyApp
</pre></div>
</li>
</ul>
</li>
<li>Prior to JDK 8u40 release, the JVM must also have been started with
the flag: <code>-XX:+UnlockCommercialFeatures -XX:FlightRecorder</code>. Since
<b>JDK 8u40</b>, the JFR can <i>be enabled during <b>runtime</b></i>.
</li>
<li>You can also set up JMC to automatically start or dump a flight
recording if a condition is met.
<ul class="org-ul">
<li>There are several default triggers set up for common conditions
such as high CPU usage, deadlocked threads, or too large of a live
set.
</li>
<li>You can choose to create a trigger on <b>any MBean</b> in the application.
</li>
</ul>
</li>
<li>Most GCs in Java have some kind of smaller garbage collections. The
<i>old GC goes through the entire Java heap</i>, while the other GC might
look at part of the heap. The heap usage after an old collection is
the memory the application is using, which is called the <b>live set</b>.
</li>
<li>For a better way to address memory leaks, look at the <i><b>Heap After GC</b>
value in the first and last old GC</i>. There could be a memory leak when
<i>this value is increasing over time</i>.
</li>
<li>
<i>Small objects</i> in Java are allocated in a <b>TLAB (Thread Local Area
Buffer)</b>.
<ul class="org-ul">
<li>TLAB is a small memory area where new objects are allocated.
</li>
<li>Once a TLAB is full, the thread gets a new one. Logging all memory
allocations gives an overhead; therefore, all allocations that
triggered a new TLAB are logged.
</li>
<li>Larger objects are allocated outside TLAB, which are also logged.
</li>
</ul>
</li>
<li>
</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/java/" rel="tag">java</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../javascript-note/" rel="prev" title="Javascript Note">Previous post</a>
            </li>
            <li class="next">
                <a href="../java-problems/" rel="next" title="Java Problems">Next post</a>
            </li>
        </ul></nav></aside></article><footer id="footer"><p>Contents © 2017         <a href="mailto:wudong@graceliu.uk">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </div>
    <label for="sidebar-checkbox" class="sidebar-toggle"></label>
    
    
    
            <script src="../../../assets/js/jquery.min.js"></script><script src="../../../assets/js/moment-with-locales.min.js"></script><script src="../../../assets/js/fancydates.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
